/********************************************************   
【平    台】龙丘KL46最小系统版
【编    写】龙丘
【Designed】by Chiu Sir
【E-mail  】chiusir@aliyun.com
【软件版本】V2.0
【最后更新】2013年12月24日
【dev.env.】IAR6.50
【Target  】KL46
【Crystal 】50.000Mhz
------------------------------------
使用北京龙邱智能科技cortex-M0开发工具箱
*********************************************************/

#ifndef __WDOG_H__
#define __WDOG_H__

    //1 头文件	
    #include "common.h"
    
    //2 宏定义
    
    //3 函数声明
    //-------------------------------------------------------------------------*
    //函数名: wdog_disable                                                     *
    //功  能: 关闭看门狗模块                                                   * 
    //参  数: 无							       *	
    //返  回: 无                                                               *
    //说  明: 无                                                               *
    //-------------------------------------------------------------------------*
    void wdog_disable(void);
    
    //-------------------------------------------------------------------------*
    //函数名: wdog_unlock                                                      *
    //功  能: 看门狗解锁                                                       * 
    //参  数: 无					             	       *	
    //返  回: 无                                                               *
    //说  明: 无                                                               *
    //-------------------------------------------------------------------------*
    void wdog_unlock(void);

#endif 
