/********************************************************   
【平    台】龙丘KL46最小系统版
【编    写】龙丘
【Designed】by Chiu Sir
【E-mail  】chiusir@aliyun.com
【软件版本】V2.0
【最后更新】2013年12月24日
【相关信息参考下列地址】 
【网    站】http://www.lqist.cn
【淘宝店铺】http://longqiu.taobao.com
------------------------------------------------
【dev.env.】IAR6.50
【Target  】KL46
【Crystal 】50.000Mhz
------------------------------------
使用北京龙邱智能科技cortex-M0开发工具箱
*********************************************************/

#include "common.h"
#include "assert.h"
#include "uart.h"
//-------------------------------------------------------------------------*
//函数名: stop                                                             *
//功  能: 设置CPU为STOP模式                                                * 
//参  数: 无								   *	
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void stop (void)
{
    //置位SLEEPDEEP来使能STOP模式
    SCB_SCR |= SCB_SCR_SLEEPDEEP_MASK;	
    //进入STOP模式
    asm("WFI");
}

//-------------------------------------------------------------------------*
//函数名: wait                                                             *
//功  能: 设置CPU为WAIT模式                                                * 
//参  数: 无								   *	
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void wait (void)
{
    //清SLEEPDEEP位来确定进入WAIT模式
    SCB_SCR &= ~SCB_SCR_SLEEPDEEP_MASK;	
    //进入WAIT模式
    asm("WFI");
}

//-------------------------------------------------------------------------*
//函数名: write_vtor                                                       *
//功  能: 更改中断向量表偏移寄存器的值                                     * 
//参  数: 要更改的值    						   *	
//返  回: 无                                                               *
//说  明: 无                                                               *
//-------------------------------------------------------------------------*
void write_vtor (int vtor)
{
    //写新值
    SCB_VTOR = vtor;	
}

//-------------------------------------------------------------------------*
//函数名: enable_irq                                                       *
//功  能: 使能irq中断                                                      * 
//参  数: irq:irq号       						   *	
//返  回: 无                                                               *
//说  明: irq号不是中断向量号                                              *
//-------------------------------------------------------------------------*
void enable_irq (int irq)
{
    if (irq > 32)
    {
            ;// printf("\nERR! Invalid IRQ value passed to enable irq function!\n");
      
    }
    else
    {
      /* Set the ICPR and ISER registers accordingly */
      NVIC_ICPR |= 1 << (irq%32);
      NVIC_ISER |= 1 << (irq%32);
    }
}

//-------------------------------------------------------------------------*
//函数名: disable_irq                                                      *
//功  能: 禁止irq中断                                                      * 
//参  数: irq:irq号       						   *	
//返  回: 无                                                               *
//说  明: irq号不是中断向量号                                              *
//-------------------------------------------------------------------------*
void disable_irq (int irq)
{
  
     NVIC_ICER = 1 << (irq%32);   
}
 
//-------------------------------------------------------------------------*
//函数名: set_irq_priority                                                 *
//功  能: 设置irq中断和优先级                                              * 
//参  数: irq:irq号         						   *	
//        prio:优先级						           *	
//返  回: 无                                                               *
//说  明: irq号不是中断向量号                                              *
//-------------------------------------------------------------------------*
void set_irq_priority (int irq, int prio)
{
            
}


void out_char (char ch)
{
   uart_putchar(UART1, ch);
  
  
}

