/*
************************************************************************
*                北京邮电大学 KL46 学习例程                                        
* 文件名 :[assert.c] 
* 描  述 ：assert断言函数
*改进与移植：Hyoga
*  Email ：498339494@qq.com
* 说  明 ：assert断言
***********************************************************************
*/
#include "common.h"
#include "includes.h"

/********************************************************************/
//如果断言条件不成立，进入了错误状态，就会打印错误信息和用LED来显示状态
void assert_failed()
{
    while (1)
    {
      delayms(50);
      KL46_LED_Turn();
      uartPrintf("Error!错误发生在某个断言处\n");  //打印错误信息
    }
}
void assert_failed1(char* output)
{
    while (1)
    {
      delayms(50);
      KL46_LED_Turn();
      uartPrintf("Error!%s\n",output);  //打印错误信息
    }
}
/********************************************************************/
