/********************************************************   
【平    台】龙丘KL46最小系统版
【编    写】龙丘
【Designed】by Chiu Sir
【E-mail  】chiusir@aliyun.com
【软件版本】V2.0
【最后更新】2013年12月24日
【相关信息参考下列地址】 
【网    站】http://www.lqist.cn
【淘宝店铺】http://longqiu.taobao.com
------------------------------------------------
【dev.env.】IAR6.50
【Target  】KL46
【Crystal 】50.000Mhz
------------------------------------
使用北京龙邱智能科技cortex-M0开发工具箱
*********************************************************/
#include "KL46_light.h"               //指示灯驱动程序头文件   

//-------------------------------------------------------------------------*
//函数名: void KL46_LED_Init()                                             *
//功  能: 初始化指示灯状态                                                 *
//参  数:无                                                                *
//返  回: 无                                                               *
//说  明: 调用gpio_init函数                                                * 
//-------------------------------------------------------------------------*
void KL46_LED_Init()
{
   gpio_init(PORTB,23,GPO ,0);//初始化指示灯
}

//-------------------------------------------------------------------------* 
//函数名: light_control                                                    *
//功  能: 控制灯的亮和暗                                                   *
//参  数: port:端口名                                                      *
//        name:指定端口引脚号                                              *
//        state:状态,1=高电平,0=低电平                                     *
//返  回: 无                                                               *
//说  明: 调用gpio_ctrl函数                                                * 
//-------------------------------------------------------------------------*   
void KL46_LED_Set(int state)
{
	gpio_set(PORTB,23,state);   //控制引脚状态     
} 

//-------------------------------------------------------------------------* 
//函数名: light_change                                                     *
//功  能: 状态切换:原来"暗",则变"亮";原来"亮",则变"暗"                     *
//参  数: port:端口名                                                      *
//        name:指定端口引脚号                                              *
//返  回: 无                                                               *
//说  明: 调用gpio_reverse函数                                             *
//-------------------------------------------------------------------------*  
void KL46_LED_Turn(void)
{
	gpio_turn(PORTB,23);
}
